<?php
/* 
Задание 4
Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.
*/
header('Content-Type: text/html; charset=utf-8'); 


$alphabet = [
    "а"=> "a", "б"=> "b","в"=> "v","г"=> "g","д"=> "d","е"=> "e","ё"=> "io","ж"=> "dj","з"=> "z","и"=> "i","й"=> "i","к"=> "k","л"=> "l","м"=> "m","н"=> "n", "о"=> "o","п"=> "p","р"=> "r","с"=> "s","т"=> "t","у"=> "u","ф"=> "f","х"=> "h","ц"=> "ts","ч"=> "tch","ш"=> "sh","щ"=> "sh","ъ"=> "","ы"=> "i","ь"=> "", "э"=> "ie","ю"=> "yu","я"=> "ya"," "=>" "
];

$str = "как дела";
function transliteration (string $str) {
    global $alphabet;
    $result = "";
    for ($i=0; $i < strlen($str) ; $i++) { 
        $result .= $alphabet[$str[$i]];
    }
    return $result;
}

echo transliteration($str);